//БИТ.AKU.28.01.2021 ->   
// Почему-то был закоментарен кусок с обогащением 
Если ОбъектОбработки = ПараметрыАлгоритма.Прочий Тогда   
	Параметры.Объект.КодГосударственногоОргана = "";   
	 
	Заявка = ?(ТипЗнч(Параметры.Форма.Объект.Ссылка)=Тип("ЗадачаСсылка.ЗадачаИсполнителя"),Параметры.Форма.Задание,Параметры.Форма.Объект);        
	  
	РеквизитИД = Параметры.Форма.пМетаданные.Реквизиты.КодГосударственногоОргана.Идентификатор;      
	СтрокаОбогащения = Заявка.НастройкиОбновленияДанных.НайтиСтроки(новый Структура("РеквизитИД", РеквизитИД));      
	Если СтрокаОбогащения.Количество() = 0 Тогда       
		СтрокаОбогащения = Заявка.НастройкиОбновленияДанных.Добавить();      
		СтрокаОбогащения.РеквизитИД = РеквизитИД;      
	Иначе      
		СтрокаОбогащения = СтрокаОбогащения[0];      
	КонецЕсли;      
	СтрокаОбогащения.Обогащать = Истина;      
	   
	Параметры.ИзменятьДанные = Истина;   
КонецЕсли;   
//<-   
   

