//БИТ.AKU.29.01.2021 ->  
Служебный = Параметры.Объект.Служебный; 
Если НЕ Служебный Тогда 
//<- 
	//БИТ.AKU.13.01.2021 ->     
	ТекИНН = Параметры.Объект.ИНН; //Объект.ИНН;      
	Пока СтрНайти(ТекИНН, " ") > 0 цикл      
		ТекИНН = СтрЗаменить(ТекИНН, " ", "");       
	КонецЦикла;      
	Параметры.Объект.ИНН = ТекИНН;      
	  
	ИННПравильный = Ложь;      
	БИТ_АлгоритмыКлиентСервер.УстановитьТекстПроверкиДляИННКПП(Параметры.Объект,       
															Параметры.Форма.Элементы.ИНН,       
															Параметры.Форма.Элементы.КПП,  
															ИННПравильный,       
															Параметры.Объект.Вид_контрагента.Наименование);      
	     
 
	// Изменение вида контрагента на юр. лицо если подходящий ИНН 
	ЭтоЮрЛицо = БИТ_АлгоритмыСервер.ЭтоЮрЛицо(Параметры.Объект.Вид_контрагента);     
	РезультатПроверки  = БИТ_АлгоритмыСервер.ПроверитьСоответствиеТребованиямИНН(Параметры.Объект.ИНН, ЭтоЮрЛицо);     
	Если РезультатПроверки.СоответствуетТребованиям   
		И ЭтоЮрЛицо <> РезультатПроверки.ЭтоЮрЛицо   
		И РезультатПроверки.ЭтоЮрЛицо Тогда   
	     
		Параметры.Вставить("НовыйВид_контрагента", ПараметрыАлгоритма.ЮрЛицо);     
		     
		ВыполнитьАлгоритм(ПараметрыАлгоритма.ИзменитьВид, ОбъектОбработки, Параметры);      
	КонецЕсли; 
		 
	////БИТ.AKU.12.01.2021 9:48:03 ->   
	//// п.40,41,43,46   
	////Иначе   
	////ИначеЕсли Параметры.Объект.Вид_контрагента <> ПараметрыАлгоритма.ФизЛицо   
	//	И Параметры.Объект.Страна_Регистрации = Справочники.СтраныМира.Россия Тогда   
	////<-   
	//	ТекстОшибкиИНН     = РезультатПроверки.ОписаниеОшибки;     
	//	Если ЗначениеЗаполнено(ТекстОшибкиИНН) Тогда     
	//		Сообщить(ТекстОшибкиИНН);     
	//	КонецЕсли;      
	//КонецЕсли;	   
	////<-     
	////<-     
		  
	// Не проверяем иностранных контрагентов.  
	ЭтоИностранныйКонтрагент 	= Параметры.Объект.Страна_Регистрации <> Справочники.СтраныМира.Россия; // Может быть незаполненным  
	  
	ДанныеКонтрагента = Новый Структура;  
	ДанныеКонтрагента.Вставить("ИНН",                СокрЛП(Параметры.Объект.ИНН));  
	ДанныеКонтрагента.Вставить("КПП",                СокрЛП(Параметры.Объект.КПП));  
	ДанныеКонтрагента.Вставить("Дата",               Неопределено);  
	ДанныеКонтрагента.Вставить("Состояние",          ПредопределенноеЗначение("Перечисление.СостоянияСуществованияКонтрагента.ПустаяСсылка"));  
	ДанныеКонтрагента.Вставить("ЭтоЮридическоеЛицо", БИТ_АлгоритмыСервер.ЭтоЮрЛицо(Параметры.Объект.Вид_контрагента));  
	ДополнительныеПараметрыПроверки = Неопределено;  
	  
	Если НЕ ЭтоИностранныйКонтрагент  
		И Параметры.Объект.Вид_контрагента <> ПараметрыАлгоритма.ФизЛицо Тогда 
		Отказ = ПроверкаКонтрагентовКлиентСервер.НайденыОшибкиВДанных(  
			ДанныеКонтрагента,  
			ТекущаяДатаСеанса(),  
			ДополнительныеПараметрыПроверки);  
		  
		Если Отказ 
			И ЗначениеЗаполнено(СокрЛП(Параметры.Объект.КПП)) Тогда  
			//Форма.СтатусПроверкиФНС = ДанныеКонтрагента.Состояние;  
			Сообщить(Строка(ДанныеКонтрагента.Состояние));   
		КонецЕсли;  
	КонецЕсли;  
	//<-  
	     
	//БИТ.AKU.01.12.2020 ->     
	Параметры.Объект.Заполнено_по_ЕГРЮЛ_ЕГРИП = Ложь;       
	Параметры.ИзменятьДанные = Истина;       
	//<-     
	//<- 														     
КонецЕсли; 
		      
// Проверка на КПП по ФНС и вывод статуса 
ЦветТекстаКрасный	= Новый Цвет(255, 40, 0);        
ЦветТекстаЗеленый 	= Новый Цвет(51, 153, 102);        
ЦветТекстаСерый		= Новый Цвет(127, 127, 127);        
        
Если Параметры.Объект.Вид_контрагента <> ПараметрыАлгоритма.ФизЛицо 
//	И Параметры.Объект.Вид_контрагента <> ПараметрыАлгоритма.Предприниматель 
	И Параметры.Объект.Страна_Регистрации = Справочники.СтраныМира.Россия 
	И НЕ Служебный Тогда    
//	Если ЗначениеЗаполнено(Параметры.Объект.ИНН)         
//		И ЗначениеЗаполнено(Параметры.Объект.КПП) Тогда         
		Параметры.Объект.СтатусПроверкиФНС = ПроверкаКонтрагентов.СостояниеКонтрагента(Параметры.Объект.ИНН, Параметры.Объект.КПП, ТекущаяДатаСеанса());          
		Параметры.Форма.СтатусПроверкиФНС = ПроверкаКонтрагентов.СостояниеКонтрагента(Параметры.Объект.ИНН, Параметры.Объект.КПП, ТекущаяДатаСеанса());          
		Если Параметры.Объект.СтатусПроверкиФНС = ПредопределенноеЗначение("Перечисление.СостоянияСуществованияКонтрагента.НеДействуетИлиИзмененКПП") Тогда          
			Параметры.Форма.Элементы.СтатусПроверкиФНС.ЦветТекста = ЦветТекстаСерый;          
		ИначеЕсли Параметры.Объект.СтатусПроверкиФНС = ПредопределенноеЗначение("Перечисление.СостоянияСуществованияКонтрагента.КонтрагентЕстьВБазеФНС") Тогда          
			Параметры.Форма.Элементы.СтатусПроверкиФНС.ЦветТекста = ЦветТекстаЗеленый;          
		Иначе          
			Параметры.Форма.Элементы.СтатусПроверкиФНС.ЦветТекста = ЦветТекстаКрасный;          
		КонецЕсли;          
//	Иначе	         
//		Параметры.Объект.СтатусПроверкиФНС = ПредопределенноеЗначение("Перечисление.СостоянияСуществованияКонтрагента.ПустойИННИлиКПП");          
//		Параметры.Форма.Элементы.СтатусПроверкиФНС.ЦветТекста = ЦветТекстаКрасный;          
//	КонецЕсли;          
	Параметры.Форма.Элементы.СтатусПроверкиФНС.Видимость = Истина;           
Иначе	         
	//БИТ.AKU.09.02.2021 ->     
//	Параметры.Объект.СтатусПроверкиФНС = ПредопределенноеЗначение("Перечисление.СостоянияСуществованияКонтрагента.ПустойИННИлиКПП");          
//	Параметры.Форма.СтатусПроверкиФНС = ПредопределенноеЗначение("Перечисление.СостоянияСуществованияКонтрагента.ПустойИННИлиКПП");          
	Параметры.Объект.СтатусПроверкиФНС = "";          
	Параметры.Форма.СтатусПроверкиФНС = "";          
	//<- 
	Параметры.Форма.Элементы.СтатусПроверкиФНС.Видимость = Ложь;           
КонецЕсли;          
		      
//Параметры.ИзменятьДанные = Истина;          
Параметры.ОбновлятьОтображение = Истина;        
 
	 

