//БИТ.AKU.13.01.2021 ->       
// Проверка на КПП      
ЦветТекстаКрасный 	= Новый Цвет(255, 40, 0);       
ЦветТекстаЗеленый 	= Новый Цвет(51, 153, 102);       
ЦветТекстаСерый		= Новый Цвет(127, 127, 127);       
       
Если Параметры.Форма.Вид_контрагента <> ПараметрыАлгоритма.Предприниматель       
	И Параметры.Форма.Вид_контрагента <> ПараметрыАлгоритма.ФизЛицо Тогда  
	Если ЗначениеЗаполнено(Параметры.Форма.ИНН)       
		И ЗначениеЗаполнено(Параметры.Форма.КПП) Тогда       
		Параметры.Форма.СтатусПроверкиФНС = ПроверкаКонтрагентов.СостояниеКонтрагента(Параметры.Форма.ИНН, Параметры.Форма.КПП, ТекущаяДатаСеанса());        
		Если Параметры.Форма.СтатусПроверкиФНС = ПредопределенноеЗначение("Перечисление.СостоянияСуществованияКонтрагента.НеДействуетИлиИзмененКПП") Тогда        
			Параметры.Форма.Элементы.СтатусПроверкиФНС.ЦветТекста = ЦветТекстаСерый;        
		ИначеЕсли Параметры.Форма.СтатусПроверкиФНС = ПредопределенноеЗначение("Перечисление.СостоянияСуществованияКонтрагента.КонтрагентЕстьВБазеФНС") Тогда        
			Параметры.Форма.Элементы.СтатусПроверкиФНС.ЦветТекста = ЦветТекстаЗеленый;        
		Иначе        
			Параметры.Форма.Элементы.СтатусПроверкиФНС.ЦветТекста = ЦветТекстаКрасный;        
		КонецЕсли;        
	Иначе	       
		Параметры.Форма.СтатусПроверкиФНС = ПредопределенноеЗначение("Перечисление.СостоянияСуществованияКонтрагента.ПустойИННИлиКПП");        
		Параметры.Форма.Элементы.СтатусПроверкиФНС.ЦветТекста = ЦветТекстаКрасный;        
	КонецЕсли;        
	Параметры.Форма.Элементы.СтатусПроверкиФНС.Видимость = Истина;         
Иначе	       
	Параметры.Форма.Элементы.СтатусПроверкиФНС.Видимость = Ложь;         
КонецЕсли;        
//<- 														      
  
нсиАлгоритмыОбработкиДанныхЗаявокСервер.ВыполнитьАлгоритмОбновленияОтображения(Параметры.Форма);    

