//БИТ.AKU.23.01.2021 ->    
НеСлужебный = НЕ Параметры.Объект.Служебный;   
//<-   
Если Строка(Параметры.Объект.Вид_Контрагента) <> "Физическое лицо" 
	И Строка(Параметры.Объект.Вид_Контрагента) <> "Государственный орган" Тогда 
	Если (Параметры.Объект.Страна_Регистрации <> Справочники.СтраныМира.Россия) И НеСлужебный Тогда 
		Параметры.Объект.КПП = ""; 
		//БИТ.AKU.12.01.21 ->  
		Параметры.Объект.ОГРН = "";  
		//<-  
	КонецЕсли; 
 
	Если Параметры.Объект.Обособленное_Подразделение Тогда 
		Если ЗначениеЗаполнено(Параметры.Объект.Головной_Контрагент) Тогда 
			ИННГоловногоКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Объект.Головной_Контрагент, "ИНН"); 
			Если Параметры.Объект.ИНН <> ИННГоловногоКонтрагента Тогда 
				Параметры.Объект.ИНН = ИННГоловногоКонтрагента; 
			КонецЕсли; 
		Иначе 
			Параметры.Объект.ИНН = ""; 
		КонецЕсли; 
	КонецЕсли; 
 
	Параметры.ИзменятьДанные = Истина; 
	Параметры.ОбновлятьОтображение = Истина; 
КонецЕсли;	 

