// >> 1БИТ, Скоков, 04.12.2020, Задача MDM-65
//
// Описание алгоритма:
// 		Алгоритм выполняет заполнение массива параметров,
//		которые необходимых для объединения заявок.
//
// Настройки алгоритма:
// 		Наименование			Банковские счета Объединение заявок
// 		Область применения		Объединение заявок
//
// Параметры передаваемые в алгоритм:
// 		ОбъектОбработки			- ДанныеФормыСтруктура структуру реквизитов создаваемого элемента справочника
// 		Параметры.МассивВариантовПоиска	- массив настройки поиска заявок для объединения
// 		Параметры.ЗаявкаОбъект	- БизнесПроцессОбъект.нсиЗаявкаНаИзменение - объект бизнес-процесса

#Область Алгоритм_объединения_заявок_по_банковским_счетам

КлючиПоиска = Новый Структура;
КлючиПоиска.Вставить("НомерСчета", ОбъектОбработки.НомерСчета);
КлючиПоиска.Вставить("БанкРасчетов", ОбъектОбработки.БанкРасчетов);
КлючиПоиска.Вставить("Контрагент", ОбъектОбработки.Контрагент);
КлючиПоиска.Вставить("бит_ЛицевойСчет", ОбъектОбработки.бит_ЛицевойСчет);

МетодыСравнения = Новый Структура;
МетодыСравнения.Вставить("НомерСчета", "=");
МетодыСравнения.Вставить("БанкРасчетов", "=");
МетодыСравнения.Вставить("Контрагент", "=");
МетодыСравнения.Вставить("бит_ЛицевойСчет", "=");

ВариантПоиска = Новый Структура;
ВариантПоиска.Вставить("КлючиПоиска", КлючиПоиска);
ВариантПоиска.Вставить("МетодыСравнения", МетодыСравнения);

Параметры.МассивВариантовПоиска.Добавить(ВариантПоиска);

#КонецОбласти
// << 1БИТ, Скоков, 04.12.2020, Задача MDM-65

