//Если ОбъектОбработки Тогда  
//	Параметры.Форма.Элементы.Наименование.Доступность = Истина;   
//	Параметры.Форма.Элементы.ПолноеНаименование.Доступность = Истина;   
//	Параметры.Форма.Элементы.КПП.Доступность = Истина;   
//	Параметры.Форма.Элементы.ОГРН.Доступность = Истина;   
//	Параметры.Форма.Элементы.Полное_наименование_ЕГРЮЛ.Доступность = Истина;   
//Иначе  
//	Параметры.Форма.Элементы.Наименование.Доступность = Ложь;   
//	Параметры.Форма.Элементы.ПолноеНаименование.Доступность = Ложь;   
//	Параметры.Форма.Элементы.КПП.Доступность = Ложь;   
//	Параметры.Форма.Элементы.ОГРН.Доступность = Ложь;   
//	Параметры.Форма.Элементы.Полное_наименование_ЕГРЮЛ.Доступность = Ложь;   
//КонецЕсли;  
//  
Параметры.ИзменятьДанные = Истина;   
Параметры.ОбновлятьОтображение = Истина;   

