// >> 1БИТ, Скоков, 04.12.2020, Задача MDM-54
//
// Описание алгоритма:
// 		Вспомогательный алгоритм, используется в качестве параметра в алгоритме:
// 		"Показать измененные реквизиты" (MDM-54)
// 		"Сравнить с сырыми данными" (MDM-66)
//
// Настройки алгоритма:
// 		Наименование			Получить структуру реквизитов
// 		Область применения		Произвольный алгоритм
//
// Параметры передаваемые в алгоритм:
// 		ОбъектОбработки			СправочникСсылка.нсиВидыЗаявок
// 		РезультатВыполнения		Структура

#Область Алгоритм_получения_структуры_реквизитов

ТекстЗапроса =
	"ВЫБРАТЬ
	|	нсиНастройкиОтображенияДанныхЗаявокРеквизиты.Имя КАК Имя,
	|	нсиНастройкиОтображенияДанныхЗаявокРеквизиты.Наименование КАК Наименование
	|ИЗ
	|	Справочник.нсиВидыЗаявок КАК нсиВидыЗаявок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.нсиНастройкиОтображенияДанныхЗаявок КАК нсиНастройкиОтображенияДанныхЗаявок
	|		ПО нсиВидыЗаявок.Ссылка = нсиНастройкиОтображенияДанныхЗаявок.ВидЗаявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.нсиНастройкиОтображенияДанныхЗаявок.Реквизиты КАК нсиНастройкиОтображенияДанныхЗаявокРеквизиты
	|		ПО (нсиНастройкиОтображенияДанныхЗаявок.Ссылка = нсиНастройкиОтображенияДанныхЗаявокРеквизиты.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.нсиВидыЗаявок.СтруктураФормы КАК нсиВидыЗаявокСтруктураФормы
	|		ПО нсиВидыЗаявок.Ссылка = нсиВидыЗаявокСтруктураФормы.Ссылка
	|			И (нсиНастройкиОтображенияДанныхЗаявокРеквизиты.ИдентификаторРеквизита = нсиВидыЗаявокСтруктураФормы.Идентификатор)
	|ГДЕ
	|	нсиВидыЗаявок.Ссылка = &Ссылка
	|	И нсиНастройкиОтображенияДанныхЗаявокРеквизиты.Виден
	|	И нсиНастройкиОтображенияДанныхЗаявокРеквизиты.Имя <> """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	нсиВидыЗаявокСтруктураФормы.НомерСтроки";

Запрос = Новый Запрос(ТекстЗапроса);
Запрос.УстановитьПараметр("Ссылка", ОбъектОбработки);
Выборка = Запрос.Выполнить().Выбрать();

РезультатВыполнения = Новый Структура;

Пока Выборка.Следующий() Цикл
	РезультатВыполнения.Вставить(Выборка.Имя, Выборка.Наименование);
КонецЦикла;

#КонецОбласти
// << 1БИТ, Скоков, 04.12.2020, Задача MDM-54

