КлючиПоиска = Новый Структура;
КлючиПоиска.Вставить("НомерДоговора", ОбъектОбработки.НомерДоговора);
КлючиПоиска.Вставить("ДатаДоговора", ОбъектОбработки.ДатаДоговора);
КлючиПоиска.Вставить("Контрагент", ОбъектОбработки.Контрагент);
КлючиПоиска.Вставить("Организация", ОбъектОбработки.Организация);
КлючиПоиска.Вставить("Наименование", ОбъектОбработки.Наименование);
КлючиПоиска.Вставить("ВидДокумента", ОбъектОбработки.ВидДокумента);
КлючиПоиска.Вставить("ВидДоговора", ОбъектОбработки.ВидДоговора);

МетодыСравнения = Новый Структура;
МетодыСравнения.Вставить("НомерДоговора", "=");
МетодыСравнения.Вставить("ДатаДоговора", "=");
МетодыСравнения.Вставить("Контрагент", "=");
МетодыСравнения.Вставить("Организация", "=");
МетодыСравнения.Вставить("Наименование", "=");
МетодыСравнения.Вставить("ВидДокумента", "=");
МетодыСравнения.Вставить("ВидДоговора", "=");

ВариантПоиска = Новый Структура;
ВариантПоиска.Вставить("КлючиПоиска", КлючиПоиска);
ВариантПоиска.Вставить("МетодыСравнения", МетодыСравнения);

Параметры.МассивВариантовПоиска.Добавить(ВариантПоиска);

