//Сообщить("Фин справочник Счета При изменении ТЧ");   
//БИТ.AKU.24.12.2020 ->  
текСтрока = Параметры.Форма.Элементы.КС_ПереченьСчетов.ТекущиеДанные;       
Если текСтрока <> Неопределено Тогда     
	Если ЗначениеЗаполнено(текСтрока.Счет) Тогда      
		РеквизитыСчета = нсиОбщегоНазначения.ПолучитьЗначенияРеквизитов(текСтрока.Счет, "Наименование");      
		текСтрока.НаименованиеСчета = РеквизитыСчета.Наименование;      
	Иначе	     
		текСтрока.НаименованиеСчета = "";      
	КонецЕсли;      
КонецЕсли;  
//<-  
  
//БИТ.AKU.06.01.2021 ->  
//Счета без признака Субконто   
СЗСообщения = Новый СписокЗначений();    
  
Для Каждого Стр Из Параметры.Форма.КС_ПереченьСчетов Цикл    
	  
	Если ЗначениеЗаполнено(Стр.Счет) Тогда  
		ВидСправочника = нсиОбщегоНазначения.ПолучитьЗначениеРеквизита(Стр.Счет, "Владелец");    
		МетаданныеОбъекта = нсиУниверсальноеХранилище.ПолучитьМетаданные(ВидСправочника);    
		ДанныеОбъекта = нсиУниверсальноеХранилище.ПолучитьОбъект(МетаданныеОбъекта, Стр.Счет);    
  
		Если НЕ ДанныеОбъекта.Субконто_Статьи_затрат Тогда    
			СтрокаСообщения = "У счета: " + Стр.Счет + " отсутствует признак: Субконто Статьи затрат";    
			  
			Если СЗСообщения.НайтиПоЗначению(СтрокаСообщения) = Неопределено Тогда   
				СЗСообщения.Добавить(СтрокаСообщения);   
			КонецЕсли;   
		КонецЕсли;    
	КонецЕсли;    
КонецЦикла;    
  
Для Каждого Стр Из СЗСообщения Цикл    
	Сообщить(Стр.Значение);    
КонецЦикла;    
//<-  
  
//БИТ.AKU.06.01.2021 ->       
Отказ = Ложь;  
БИТ_АлгоритмыКлиент.УбратьДублиВТабличнойЧасти(Параметры.Форма, "КС_ПереченьСчетов", "Счет", Отказ);   
//<-       

