// >> 1БИТ, Скоков, 09.12.2020, Задача MDM-65
//
// Описание алгоритма:
// 		Алгоритм выполняет заполнение массива параметров,
//		которые необходимых для объединения заявок.
//
// Настройки алгоритма:
// 		Наименование			Прочие доходы и расходы Объединение заявок
// 		Область применения		Объединение заявок
//
// Параметры передаваемые в алгоритм:
// 		ОбъектОбработки			- ДанныеФормыСтруктура структуру реквизитов создаваемого элемента справочника
// 		Параметры.МассивВариантовПоиска	- массив настройки поиска заявок для объединения
// 		Параметры.ЗаявкаОбъект	- БизнесПроцессОбъект.нсиЗаявкаНаИзменение - объект бизнес-процесса

#Область Алгоритм_объединения_заявок_по_прочим_доходам_и_расходам

КлючиПоиска = Новый Структура;
КлючиПоиска.Вставить("ЭтоГруппа", ОбъектОбработки.ЭтоГруппа);
КлючиПоиска.Вставить("Наименование", ОбъектОбработки.Наименование);

МетодыСравнения = Новый Структура;
МетодыСравнения.Вставить("ЭтоГруппа", "=");
МетодыСравнения.Вставить("Наименование", "=");

Если НЕ ОбъектОбработки.ЭтоГруппа Тогда
	КлючиПоиска.Вставить("ВидПрочихДоходовИРасходов", ОбъектОбработки.ВидПрочихДоходовИРасходов);
	КлючиПоиска.Вставить("ПринятиеКНалоговомуУчету", ОбъектОбработки.ПринятиеКНалоговомуУчету);
	МетодыСравнения.Вставить("ВидПрочихДоходовИРасходов", "=");
	МетодыСравнения.Вставить("ПринятиеКНалоговомуУчету", "=");
КонецЕсли;

ВариантПоиска = Новый Структура;
ВариантПоиска.Вставить("КлючиПоиска", КлючиПоиска);
ВариантПоиска.Вставить("МетодыСравнения", МетодыСравнения);

Параметры.МассивВариантовПоиска.Добавить(ВариантПоиска);

#КонецОбласти
// << 1БИТ, Скоков, 09.12.2020, Задача MDM-65

