//Для каждого элемент из Параметры.Форма.элементы цикл      	 
//	СтруктураПроверка = Новый Структура; 
//	СтруктураПроверка.Вставить("ОтметкаНезаполненного", NULL);	 
//	ЗаполнитьЗначенияСвойств(СтруктураПроверка, элемент);     	 
//	Если не СтруктураПроверка.ОтметкаНезаполненного = NULL Тогда 
//			элемент.ОтметкаНезаполненного = Ложь;	 
//	конецесли; 
//	 
//КонецЦикла; 
//  
//Параметры.ОбновлятьОтображение = Истина;  
 
Параметры.Объект.MDM_Key = Параметры.Объект.ЭталонныйЭлемент.MDM_Key; 
 
если Параметры.Объект.ДатаНачалаАктуальности = Дата(1,1,1) тогда  
	Параметры.Объект.ДатаНачалаАктуальности = ТекущаяДата();  
конецесли;  
  
если Параметры.Объект.Причина = "" тогда  
	Параметры.Объект.Причина = "Нормализация, найден эталонный элемент";  
конецесли;  
Попытка 
если Параметры.Объект.КС_КодСтатьи = "" тогда   
	Параметры.Объект.КС_КодСтатьи = Параметры.Объект.ЭталонныйЭлемент.КС_КодСтатьи; 
конецесли;  
исключение 
конецпопытки; 
 
//Параметры.Форма.БИТ_MDM_Key = Параметры.Объект.ЭталонныйЭлемент.MDM_Key; 
 
//Параметры.Форма.элементы.Причина.ОтметкаНезаполненного = ложь; 
  
Параметры.ОбновлятьОтображение = Истина;  
Параметры.ИзменятьДанные = Истина; 
 

