Получатели = Параметры.Получатели;
ПараметрыПисьма = Параметры.ПараметрыПисьма;
ТелоПисьма = ПараметрыПисьма.Тело;
ИмяСобытияЖурналаРегистрации = НСтр("ru = 'Бизнес-процессы и задачи. Уведомление'");
УчетнаяЗаписьЭлектроннойПочты = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();

Для Каждого Получатель Из Получатели Цикл
	ПочтовыйАдресПолучателя = БИТ_ОбщегоНазначенияСервер.ПолучитьВсеАдресаЭлектроннойПочтыПользователя(Получатель);
	Если ПустаяСтрока(ПочтовыйАдресПолучателя) Тогда
		ШаблонСообщения = НСтр("ru = 'Уведомление не отправлено, так как не указан почтовый адрес у пользователя %1.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Получатель);
		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации, УровеньЖурналаРегистрации.Информация, , , ТекстСообщения);
		Продолжить;
	КонецЕсли;
	
	Текст = СтрЗаменить(ТелоПисьма, "_Кому_", СокрЛП(Получатель));
	ПараметрыПисьма.Вставить("Получатель", ПочтовыйАдресПолучателя);
	ПараметрыПисьма.Вставить("ТекстСообщения", Текст);
	
	Попытка
		БИТ_ОбщегоНазначенияСервер.СоздатьПочтовоеСообщение(УчетнаяЗаписьЭлектроннойПочты, ПараметрыПисьма);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ШаблонСообщения = НСтр("ru = 'Ошибка при отправке уведомления о смене статуса: %1'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, ТекстОшибки);
		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
	КонецПопытки;
КонецЦикла;

