ЗавершатьАвтоматически = Истина;
Отказ = Истина;

// >> 1БИТ, Скоков, 18.01.2021, Задача MDM-51
//
// Описание алгоритма:
// 		Алгоритм изменения значения реквизита РезультатВыполнения Заявки.
// 		Вызывается в случае автозавершении задачи.
// 		Использует реквизит РезультатВыполнения Задачи, для передачи
// 		дополнительного описания в реквизит РезультатВыполнения Заявки.
//
// Настройки алгоритма:
// 		Наименование			Финансовые Автозавершение задачи
// 		Область применения		Автоматическое завершение задач
//
// Параметры передаваемые в алгоритм:
// 		Доступны все переменные процедуры ВыполнитьАлгоритмАвтоматическойОбработки
//		общего модуля нсиОбработкаЗадачЗаявокНаИзменение

Задача.РезультатВыполнения = "автоматически";

// << 1БИТ, Скоков, 18.01.2021, Задача MDM-51

