//БИТ.AKU.11.01.2021 -> 
Форма = Параметры.Форма; 
Объект = Параметры.Объект; 
	 
Если Форма.ИмяФормы = "БизнесПроцесс.нсиЗаявкаНаИзменение.Форма.ФормаБизнесПроцесса"  
	ИЛИ Форма.ИмяФормы = "БизнесПроцесс.нсиЗаявкаНаИзменение.Форма.РаботаСЗаявками"  
	ИЛИ Форма.ИмяФормы = "БизнесПроцесс.нсиЗаявкаНаИзменение.Форма.ФормаДанныеЗаявки"  
	ИЛИ Форма.ИмяФормы = "Обработка.нсиШаблонФормЗаявки.ФормаБизнесПроцесса" Тогда	  
	Заявка = Форма.Объект; 
Иначе 
	Заявка = Форма.Задание; 
КонецЕсли; 
 
// Новый вид контрагента 
Объект.Вид_контрагента = Параметры.НовыйВид_контрагента; 
 
РеквизитИД = Форма.пМетаданные.Реквизиты.Вид_контрагента.Идентификатор;    
СтрокаОбогащения = Заявка.НастройкиОбновленияДанных.НайтиСтроки(новый Структура("РеквизитИД", РеквизитИД));    
Если СтрокаОбогащения.Количество() = 0 Тогда     
	СтрокаОбогащения = Заявка.НастройкиОбновленияДанных.Добавить();    
	СтрокаОбогащения.РеквизитИД = РеквизитИД;    
Иначе    
	СтрокаОбогащения = СтрокаОбогащения[0];    
КонецЕсли;    
СтрокаОбогащения.Обогащать = Истина;    
 
// Физическое лицо 
Если Объект.Вид_контрагента = ПараметрыАлгоритма.ФизЛицо  
	ИЛИ Объект.Вид_контрагента = ПараметрыАлгоритма.Предприниматель Тогда 
	Объект.ЮрФизЛицо = Перечисления.нсиЮрФизЛицо.ФизЛицо; 
Иначе	 
	Объект.ЮрФизЛицо = Перечисления.нсиЮрФизЛицо.ЮрЛицо; 
КонецЕсли; 
 
РеквизитИД = Форма.пМетаданные.Реквизиты.ЮрФизЛицо.Идентификатор;    
СтрокаОбогащения = Заявка.НастройкиОбновленияДанных.НайтиСтроки(новый Структура("РеквизитИД", РеквизитИД));    
Если СтрокаОбогащения.Количество() = 0 Тогда     
	СтрокаОбогащения = Заявка.НастройкиОбновленияДанных.Добавить();    
	СтрокаОбогащения.РеквизитИД = РеквизитИД;    
Иначе    
	СтрокаОбогащения = СтрокаОбогащения[0];    
КонецЕсли;    
СтрокаОбогащения.Обогащать = Истина;    
//<- 

