//Если ЗначениеЗаполнено(ОбъектОбработки.Ссылка) Тогда 
 
	МассивСчетов = БИТ_АлгоритмыСервер.ПолучитьЗначенияУниверсальногоСправочникаБулево("План счетов", "Субконто Статьи затрат"); 
	//ТЗ_ПланСчетовДляОС = ПолучитьИзВременногоХранилища(АдресХранилища); 
 
	ТЧ_ПланСчетов = Параметры.Форма.КС_ПереченьСчетов; 
	ТЧ_ПланСчетов.Очистить(); 
 
	Для Каждого Стр Из МассивСчетов Цикл 
		НоваяСтрока = ТЧ_ПланСчетов.Добавить(); 
		НоваяСтрока.Код = Прав("    "+ТЧ_ПланСчетов.Количество(),4);    
		НоваяСтрока.ИспользуетсяВУчете = Истина; 
		НоваяСтрока.Счет = Стр.Ссылка; 
		НоваяСтрока.НаименованиеСчета = Стр.Наименование; 
	КонецЦикла; 
//Иначе 
//	Сообщить("Для заполнение счетов необходимо записать заявку"); 
//КонецЕсли; 
 
нсиЗаявкиФормыКлиент.Подключаемый_ТаблицаПриИзменении(Параметры.Форма,  
														ОбъектОбработки,  
														Параметры.Форма.Элементы.КС_ПереченьСчетов); 

