//БИТ.AKU.18.12.2020 ->  
Если Параметры.Объект.КС_Неактуально Тогда  
	Параметры.Форма.Элементы.КС_ДатаОкончанияАктуальности.Видимость = Истина;  
	Параметры.Объект.КС_ДатаОкончанияАктуальности = ТекущаяДата();  
Иначе  
	Параметры.Форма.Элементы.КС_ДатаОкончанияАктуальности.Видимость = Ложь;  
	Параметры.Объект.КС_ДатаОкончанияАктуальности = Дата('00010101');  
КонецЕсли;  
	  
Заявка = ?(ТипЗнч(Параметры.Форма.Объект.Ссылка)=Тип("ЗадачаСсылка.ЗадачаИсполнителя"),Параметры.Форма.Задание,Параметры.Форма.Объект);       
 
РеквизитИД = Параметры.Форма.пМетаданные.Реквизиты.КС_ДатаОкончанияАктуальности.Идентификатор;     
СтрокаОбогащения = Заявка.НастройкиОбновленияДанных.НайтиСтроки(новый Структура("РеквизитИД", РеквизитИД));     
Если СтрокаОбогащения.Количество() = 0 Тогда      
	СтрокаОбогащения = Заявка.НастройкиОбновленияДанных.Добавить();     
	СтрокаОбогащения.РеквизитИД = РеквизитИД;     
Иначе     
	СтрокаОбогащения = СтрокаОбогащения[0];     
КонецЕсли;     
СтрокаОбогащения.Обогащать = Истина;     
  
Параметры.ИзменятьДанные = Истина;  
//<-  
  

